# SetVPClOvrdObjTxt

## Description
```pascal
PROCEDURE SetVPClOvrdObjTxt(
				viewportHandle : HANDLE;
				className      : STRING;
				objectTexture  : INTEGER);
```

```python

def vs.SetVPClOvrdObjTxt(viewportHandle, className, objectTexture):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewpoert handle|
|className|STRING|The name of the class override|
|objectTexture|INTEGER|The object texture to be set|

## Version
Availability: from Vectorworks 2018
## Category
* Viewports